{"format": "graph-model", "generatedBy": "2.13.0-rc1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"embedding_input": {"name": "embedding_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/Cast", "op": "Cast", "input": ["embedding_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_25", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_30", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_31", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_24", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_71"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_22", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_69"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential/embedding/Cast", "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_25", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_72"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential/embedding/embedding_lookup", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/Shape", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential/lstm/strided_slice", "StatefulPartitionedCall/sequential/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/Shape", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1/packed", "StatefulPartitionedCall/sequential/lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential/lstm/zeros/packed", "StatefulPartitionedCall/sequential/lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_29", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_28", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros_1"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_26", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/lstm/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9sc3RtL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_39", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_28", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_75"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_27", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_37", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/enter/_26", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_73"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_20/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_39", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/cond/_20/while/Less"]}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_11_switch/_50", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_38", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_40", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_12_switch/_53", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_41", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_10_switch/_49", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_37", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_13_switch/_54", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_42", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_47", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_35", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_33", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_48", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_36", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_51", "op": "Switch", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/merge/_39", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/LoopCond/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_45:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_60", "op": "Exit", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_48"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_76", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_77", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_12_switch/_53:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_78", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_13_switch/_54:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_10_switch/_49:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_13_switch/_54:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_75", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_switch/_51:1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/exit/_60", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_52:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_47:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/time_switch/_47:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter_switch/_45:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_12_switch/_53:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_71", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_69", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_3", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/MatMul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_14_switch/_55:1"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense/Sigmoid", "^StatefulPartitionedCall/sequential/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split/split_dim", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid_1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/Func/StatefulPartitionedCall/sequential/lstm/PartitionedCall/input/_11_switch/_50:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_74", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_1", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Sigmoid_2", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_73", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul_2", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1_switch/_48:1", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/next_iteration/_72", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_body_control/_56"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_1/ReadVariableOp", "shape": [32, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/Read_2/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/strided_slice_2/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "unknown", "shape": [30000, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_2/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential/lstm/PartitionedCall/while/body/_21/while/add_3/y", "shape": [], "dtype": "int32"}]}]}